### `infra` Terraform workspace: `terraform plan`

Commit: ac4de607f823cf3fb6af9d8b3d221752634cb2ee
Pushed by: @jonleeyz
Action: `pull_request`

---

#### Summary:

1. `go build`:  `success ✅`
2. `terraform fmt`: ️ `success ✅`
3. `terraform init`:  `success ✅`
4. `terraform validate`:  `success ✅`
5. `terraform plan`:  `success ✅`

<details open><summary>Generated plan:</summary>

```
[0m[1mmodule.lambda.data.archive_file.zipped_binary_for_deploy: Reading...[0m[0m
[0m[1mmodule.lambda.data.archive_file.zipped_binary_for_deploy: Read complete after 0s [id=070c2a3af42a9eba33b53bb046fd3cf6516f4ee6][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.assume_lambda_role: Reading...[0m[0m
[0m[1mmodule.iam.data.aws_iam_policy_document.assume_api_gateway_role: Reading...[0m[0m
[0m[1mmodule.secrets_manager.aws_secretsmanager_secret.bot_token: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:574182556674:secret:telegram_bot_token-aaEKZR][0m
[0m[1mmodule.api_gateway.aws_api_gateway_rest_api.bball8bot: Refreshing state... [id=0w0uiuxir5][0m
[0m[1mmodule.sqs.aws_sqs_queue.bball8bot_events: Refreshing state... [id=https://sqs.ap-southeast-1.amazonaws.com/574182556674/bball8bot_event_queue][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.assume_lambda_role: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.assume_api_gateway_role: Read complete after 0s [id=2699642182][0m
[0m[1mmodule.secrets_manager.aws_secretsmanager_secret_version.bot_token: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:574182556674:secret:telegram_bot_token-aaEKZR|terraform-20240308092344634200000001][0m
[0m[1mmodule.api_gateway.aws_api_gateway_resource.bball8bot: Refreshing state... [id=j4ac03][0m
[0m[1mmodule.lambda.aws_lambda_permission.allow_sqs_event_to_trigger_lambda_event_handler: Refreshing state... [id=AllowLambdaExecutionfromSQS][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.api_gateway_policy: Reading...[0m[0m
[0m[1mmodule.lambda.aws_lambda_event_source_mapping.sqs_event_queue_to_lambda_event_handler: Refreshing state... [id=381dcbc0-a2a8-4b12-b59d-15660a4d3659][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.lambda_policy: Reading...[0m[0m
[0m[1mmodule.iam.data.aws_iam_policy_document.api_gateway_policy: Read complete after 0s [id=3446218041][0m
[0m[1mmodule.iam.data.aws_iam_policy_document.lambda_policy: Read complete after 0s [id=1459043504][0m
[0m[1mmodule.iam.aws_iam_policy.api_gateway: Refreshing state... [id=arn:aws:iam::574182556674:policy/bball8botAPIGatewayPolicy][0m
[0m[1mmodule.iam.aws_iam_policy.lambda: Refreshing state... [id=arn:aws:iam::574182556674:policy/bball8botLambdaPolicy][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method.bball8bot: Refreshing state... [id=agm-0w0uiuxir5-j4ac03-POST][0m
[0m[1mmodule.api_gateway.aws_api_gateway_method_response.bball8bot_http_200: Refreshing state... [id=agmr-0w0uiuxir5-j4ac03-POST-200][0m
[0m[1mmodule.iam.aws_iam_role.api_gateway: Refreshing state... [id=bball8botAPIGatewayRole][0m
[0m[1mmodule.iam.aws_iam_role.lambda: Refreshing state... [id=bball8botLambdaRole][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration.bball8bot: Refreshing state... [id=agi-0w0uiuxir5-j4ac03-POST][0m
[0m[1mmodule.lambda.aws_lambda_function.bball8bot_event_handler: Refreshing state... [id=bball8bot_event_handler][0m
[0m[1mmodule.api_gateway.aws_api_gateway_deployment.bball8bot_dev: Refreshing state... [id=ayu274][0m
[0m[1mmodule.api_gateway.aws_api_gateway_integration_response.bball8bot_http_200: Refreshing state... [id=agir-0w0uiuxir5-j4ac03-POST-200][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.api_gateway.aws_api_gateway_deployment.bball8bot_dev[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_api_gateway_deployment" "bball8bot_dev" {
      [33m~[0m[0m created_date  = "2024-03-08T14:15:41Z" -> (known after apply)
      [33m~[0m[0m execution_arn = "arn:aws:execute-api:ap-southeast-1:574182556674:0w0uiuxir5/dev" -> (known after apply)
      [33m~[0m[0m id            = "ayu274" -> (known after apply)
      [33m~[0m[0m invoke_url    = "https://0w0uiuxir5.execute-api.ap-southeast-1.amazonaws.com/dev" -> (known after apply)
      [33m~[0m[0m variables     = { [31m# forces replacement[0m[0m
          [31m-[0m[0m "deployed_at" = "2024-03-08T14:15:41Z"
        } -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda.aws_lambda_function.bball8bot_event_handler[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "bball8bot_event_handler" {
        id                             = "bball8bot_event_handler"
      [33m~[0m[0m last_modified                  = "2024-03-08T14:15:47.000+0000" -> (known after apply)
      [33m~[0m[0m source_code_hash               = "eL7NUKQyyZLSHSeHrr7/udTKc6g4Jao2aj0uJwLpP6c=" [33m->[0m[0m "RmghKIP7rI6vETerKQ/RAfb87XR0sMJp2uu+gMjFqc8="
        tags                           = {}
        [90m# (20 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m environment {
          [33m~[0m[0m variables = {
              [32m+[0m[0m "IS_DEBUG_LOGGING_ENABLED"                   = "true"
                [90m# (2 unchanged elements hidden)[0m[0m
            }
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m api_invoke_url      = "https://0w0uiuxir5.execute-api.ap-southeast-1.amazonaws.com/dev" -> (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

---

### Debug information

<details><summary>go build:</summary>

```

```

</details>




<details><summary>terraform fmt:</summary>

```

```

</details>




<details><summary>terraform init:</summary>

```

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing modules...[0m
- api_gateway in api_gateway
- iam in iam
- lambda in lambda
- secrets_manager in secrets_manager
- sqs in sqs

[0m[1mInitializing provider plugins...[0m
- Finding hashicorp/aws versions matching "5.35.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/aws v5.35.0...
- Installed hashicorp/aws v5.35.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.4.2...
- Installed hashicorp/archive v2.4.2 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

</details>




<details><summary>terraform validate:</summary>

```
[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

---
Comment `/terraform plan infra` to regenerate the plan.
Comment `/terraform apply infra` to apply the generated plan.
